export const SCALE_FACTOR = 4;

export const dialogueData = {
    pc: `Это мой компьютер. Сейчас я работаю в основном с JavaScript/TypeScript на фронте и NestJS/Express на бэке, включая БД такие как MySQL, Mongo, PostgreSQL используя ORM-ки.
        Я сделал несколько проектов на этом стеке, а так же это портфолио, используя KaboomJS. В любом случае, независимо от технологий, мне просто нравится программировать.
        Вот мой <a href="https://github.com/PavelGroshevskiy" target="_blank">Github</a>!`,

    "cs-degree": `Это мой диплом разработчика Web - интерфейсов, полученный в АНО ВО "Университет Иннополис". Я повесил его на стену, потому что горжусь этим.`,

    "sofa-table": `Это мой диван. Мне нравится отдыхать здесь и смотреть YouTube. 
        Я также веду свой свой канал на YouTube, где показываю свое вокальное хобби. Подпишитесь на <a href="https://www.youtube.com/channel/UCHBpAmGCmN-f1BxBPBFLSwA" target="_blank">мой канал</a>! (если вам понравился контент)`,

    tv: `Это мой телевизор. В последнее время я часто смотрю технических ютуберов, например:
        <a href="https://www.youtube.com/@AsForJS" target="_blank">AsForJS</a>, <a href="https://www.youtube.com/@TimurShemsedinov" target= "_blank">TimurShemsedinov</a>,
        <a href="https://www.youtube.com/@ansonthedev" target="_blank">ansonthedev</a> (иногда).`,

    bed: `Здесь я отдыхаю. Великолепные идеи приходят, когда я лежу на кровати и размышляю. 
          Если мне приходит в голову интересная мысль, я часто её записываю,
          иначе не могу заснуть, потому что она меня поглощает. 😊`,

    resume: `Это мой стол, и на нем мое резюме <a href="https://portfolio-six-blue-78.vercel.app/" target="_blank">здесь</a>. Проверили?</a>
        Свяжитесь со мной по адресу Pavel.groshevskiy@gmail.com, если у вас есть интересные вакансии!`,

    projects: `Информация об этом портфолио: оно создано с использованием библиотеки Kaboom.js, которая представляет собой библиотеку для создания игр на JavaScript.
        Текст отображается с помощью HTML/CSS. Вот ссылка на портфолио некоторых моих работ  <a href="https://portfolio-six-blue-78.vercel.app/" target="_blank">здесь</a>.`,

    library: `Моя немногочисленная коллекция из книг по программированию. В которой присутствуют труды Николаса Закаса, Дональд Э. Кнута`,

    exit: `Если вы хотите выйти из портфолио, просто закройте вкладку.`,
};
